// Task X [The matrix compression]
// Сжатие матрицы 
// 
// Дана математическая прямоугольная матрица размером N на M.
// Необходимо спроектировать эффективный алгоритм и разработать функцию, 
// которая уплотняет заданную матрицу, удаляя из нее строки 
// и столбцы, полностью заполненные нулями, т.е. нулевые строки 
// и/или столбцы. 
// Не забудьте про механизм "защиты от дурака".
//
// На базе разработанной функции реализовать тестовый или полноценный
// проект для демонстрации правильности работы алгоритма функции.
